{
  "interrogation_id": "interrogation_alex_swiftblade",
  "character_id": "char_alex_swiftblade",
  "title": "Допрос Алекса 'Быстрый Клинок'",
  "description": "Молодой послушник Церкви, явно нервничающий и что-то скрывающий. Ключевой свидетель в деле об убийствах торговцев.",
  "initial_patience": 100,
  "statements": [
    {
      "id": "statement_1",
      "text": "Я... я простой послушник Церкви Вечного Света. Служу уже два года, учусь у брата Теодора.",
      "press_response": {
        "text": "Простой послушник? С таким прозвищем - 'Быстрый Клинок'? Расскажите, как вы его получили.",
        "patience_cost": 10,
        "new_info": "Алекс заметно напрягается: 'Это... просто детское прозвище. Я быстро бегаю, вот и всё. Ничего особенного.'"
      },
      "correct_evidence": null,
      "contradiction_response": null
    },
    {
      "id": "statement_2",
      "text": "В ночь первого убийства я молился в соборе. Весь вечер, до рассвета. Брат Теодор может подтвердить.",
      "press_response": {
        "text": "Весь вечер молились? Никуда не выходили? Никто другой не видел вас?",
        "patience_cost": 10,
        "new_info": "Алекс отводит взгляд: 'Ну... я выходил ненадолго проветриться. Но только на минуту! Потом вернулся молиться.'"
      },
      "correct_evidence": "clue_drunk_sailor_testimony",
      "contradiction_response": {
        "text": "Показания пьяного моряка! Он видел монаха в чёрном плаще у дома Маркуса в ночь убийства! Это были вы, не так ли?!",
        "success": false,
        "character_reaction": "shocked",
        "response": "Что?! Нет! Я не... Пьяный моряк! Он ничего не помнит! Это не доказательство! Я был в соборе!",
        "patience_cost": 5,
        "unlock_statement": "statement_hidden_1"
      }
    },
    {
      "id": "statement_3",
      "text": "Я никогда не встречал этих торговцев. Маркус, Селина, Ричард... Я даже не знал их в лицо до убийств.",
      "press_response": {
        "text": "Откуда же вы знаете их имена так уверенно? Перечислили их без запинки.",
        "patience_cost": 10,
        "new_info": "Алекс бледнеет: 'Я... все в городе знают их имена! Об этих убийствах говорит весь порт! Это не означает, что я их знал!'"
      },
      "correct_evidence": "clue_selina_note",
      "contradiction_response": {
        "text": "Предсмертная записка Селины! Она писала о Церкви! О том, что 'они' убили Маркуса! Вы знали её! Знали, что она узнала правду!",
        "success": false,
        "character_reaction": "fearful",
        "response": "Нет! Я не... Она... Это совпадение! Многие подозревают всех! Это ничего не доказывает!",
        "patience_cost": 15,
        "unlock_statement": "statement_hidden_2"
      }
    },
    {
      "id": "statement_4",
      "text": "Брат Теодор - святой человек. Он учит нас чистоте веры, борьбе с ересью. Всё, что он делает - во славу Вечного Света.",
      "press_response": {
        "text": "Борьба с ересью? Что именно это означает? Какие методы использует брат Теодор?",
        "patience_cost": 10,
        "new_info": "Алекс нервно сглатывает: 'Мы... изучаем еретические тексты, чтобы знать врага. Мы выслеживаем тех, кто распространяет ложные учения. Мы... защищаем веру.'"
      },
      "correct_evidence": "clue_contraband_manifest",
      "contradiction_response": {
        "text": "Контрабандный манифест Маркуса! Еретические книги, языческие артефакты! Вот что вы называете 'ересью'! Вот почему вы его убили!",
        "success": false,
        "character_reaction": "shocked",
        "response": "Я не... Да, это ересь! Но я не убивал! Я только... Я только выполнял приказ найти эти книги! Найти, а не убивать!",
        "patience_cost": 20,
        "unlock_statement": "statement_hidden_3"
      }
    },
    {
      "id": "statement_5",
      "text": "Я не знаю, кто убил этих людей. Возможно, пираты, как говорит князь Валериан. Или грабители. Но точно не Церковь.",
      "press_response": {
        "text": "Почему вы так уверены, что это не Церковь? Слишком категоричны для человека, который 'ничего не знает'.",
        "patience_cost": 15,
        "new_info": "Алекс начинает дрожать: 'Потому что... Потому что Церковь не убивает без причины. Если бы это была Церковь, значит... значит была священная причина.'"
      },
      "correct_evidence": "clue_church_dagger",
      "contradiction_response": {
        "text": "Церковный кинжал! С символом Вечного Света! Орудие убийства! Это неопровержимое доказательство причастности Церкви!",
        "success": true,
        "character_reaction": "fearful",
        "response": "Нет! Этого не может быть! Кинжал... где вы его нашли?! Я... я думал, что его уничтожили... Я хотел его уничтожить, но брат Теодор...",
        "patience_cost": 0,
        "next_phase": "confession_start"
      }
    },
    {
      "id": "statement_hidden_1",
      "text": "Ладно, да! Я был на улице той ночью! Но не у дома Маркуса! Я просто... гулял. Размышлял о своём служении.",
      "press_response": {
        "text": "Размышляли в тёмных переулках портового города ночью? Во время убийства? Как удобно.",
        "patience_cost": 15,
        "new_info": "Алекс почти кричит: 'Я не могу спать по ночам! Меня мучают кошмары! Я вижу... я вижу их лица! Всё время!'"
      },
      "correct_evidence": null,
      "contradiction_response": null
    },
    {
      "id": "statement_hidden_2",
      "text": "Селина... она была невиновна. Она просто знала не то, что нужно. Ричард тоже. Они не заслуживали...",
      "press_response": {
        "text": "Не заслуживали чего, Алекс? Закончите фразу. Что именно они не заслуживали?",
        "patience_cost": 20,
        "new_info": "Алекс закрывает лицо руками, голос срывается: 'Смерти... они не заслуживали смерти. В отличие от Маркуса. Он торговал ересью. Но Селина и Ричард... они просто оказались не в то время не в том месте.'"
      },
      "correct_evidence": "clue_forbidden_book",
      "contradiction_response": {
        "text": "Запрещённая книга! Одна из контрабанды Маркуса! Вы знали, что он торговал такими вещами! Вы охотились на него!",
        "success": false,
        "character_reaction": "sad",
        "response": "Да! Да, мы знали! Брат Теодор сказал, что Маркус - еретик! Что он отравляет души людей этими книгами! Что мы должны остановить его!",
        "patience_cost": 25,
        "unlock_statement": null
      }
    },
    {
      "id": "statement_hidden_3",
      "text": "Брат Теодор говорил... что иногда нужна жертва во имя высшего блага. Что несколько грешников - ничто по сравнению со спасением тысяч душ.",
      "press_response": {
        "text": "И вы поверили ему? Поверили, что убийство - это 'высшее благо'?",
        "patience_cost": 25,
        "new_info": "Алекс плачет: 'Я был молод! Наивен! Я думал, что служу святому делу! Я думал, что спасаю людей от проклятия! Но теперь... теперь я вижу их лица каждую ночь...'"
      },
      "correct_evidence": "clue_cardinal_letter",
      "contradiction_response": {
        "text": "Письмо от Кардинала Малахия! Приказ 'очистить город от еретиков'! Это не философия брата Теодора - это приказ с самого верха Церкви!",
        "success": true,
        "character_reaction": "shocked",
        "response": "Что?! Кардинал?! Нет... я думал, что это только брат Теодор... только наша группа... Вы хотите сказать, что это было одобрено... на таком уровне?! Боги... что я наделал...",
        "patience_cost": 0,
        "next_phase": "full_confession"
      }
    }
  ],
  "confession_phases": [
    {
      "id": "confession_start",
      "trigger": "statement_5_broken",
      "character_emotion": "fearful",
      "text": "Хорошо... хорошо, я скажу правду. Но вы должны понять - я не хотел! Я думал, что делаю правильно! Брат Теодор сказал, что это священный долг...",
      "next": "confession_partial"
    },
    {
      "id": "confession_partial",
      "character_emotion": "sad",
      "text": "Я... я убил Селину и Ричарда. Первого - Маркуса - убил брат Теодор. Он сказал, что это испытание для меня. Что я должен доказать свою преданность Церкви.",
      "choices": [
        {
          "text": "Почему вы согласились?",
          "next": "confession_motive"
        },
        {
          "text": "Как вы это сделали?",
          "next": "confession_method"
        },
        {
          "text": "Кто ещё знал об этом?",
          "next": "confession_conspiracy"
        }
      ]
    },
    {
      "id": "full_confession",
      "trigger": "statement_hidden_3_broken",
      "character_emotion": "sad",
      "text": "Я расскажу всё. Каждую деталь. Где брат Теодор прячется, как работают 'Очистители', кто ещё в Церкви знает об этом. Я свидетельствую против них всех. Пусть хоть моё признание спасёт кого-то.",
      "effects": [
        {"type": "set_flag", "flag": "alex_full_confession", "value": true},
        {"type": "discover_clue", "clue_id": "clue_alex_confession"},
        {"type": "modify_relationship", "character": "char_alex_swiftblade", "amount": 30},
        {"type": "modify_relationship", "faction": "fact_eternal_light", "amount": -40}
      ],
      "next": null
    },
    {
      "id": "confession_motive",
      "character_emotion": "sad",
      "text": "Я был идеалистом. Думал, что Церковь - воплощение добра. Что брат Теодор - святой. Когда он сказал, что еретики губят души людей, я поверил. Когда сказал, что их нужно остановить любой ценой... я поверил.",
      "choices": [
        {
          "text": "Как вы это сделали?",
          "next": "confession_method"
        },
        {
          "text": "Кто ещё знал об этом?",
          "next": "confession_conspiracy"
        }
      ]
    },
    {
      "id": "confession_method",
      "character_emotion": "sad",
      "text": "Церковный кинжал. Удар в спину, быстро и тихо. Брат Теодор обучал нас... обучал боевым техникам. 'Защита веры', называл он это. Селина даже не вскрикнула. Ричард... Ричард пытался защищаться.",
      "choices": [
        {
          "text": "Почему вы согласились?",
          "next": "confession_motive"
        },
        {
          "text": "Кто ещё знал об этом?",
          "next": "confession_conspiracy"
        }
      ]
    },
    {
      "id": "confession_conspiracy",
      "character_emotion": "fearful",
      "text": "Брат Теодор. Я. Ещё трое послушников знают о 'Очистителях', но не все участвовали в убийствах. И... и кто-то выше. Брат Теодор получал приказы. Зашифрованные письма с печатью кардинала.",
      "effects": [
        {"type": "set_flag", "flag": "alex_partial_confession", "value": true},
        {"type": "discover_clue", "clue_id": "clue_alex_confession"},
        {"type": "set_flag", "flag": "know_purifiers", "value": true}
      ],
      "next": null
    }
  ],
  "failure_response": {
    "text": "Я... я больше не могу! Оставьте меня в покое! Я ничего не знаю! Вызовите моего адвоката из Церкви!",
    "character_emotion": "angry",
    "effects": [
      {"type": "set_flag", "flag": "alex_interrogation_failed", "value": true}
    ]
  },
  "success_conditions": [
    {
      "description": "Сломать statement_5 с помощью church_dagger",
      "result": "partial_confession"
    },
    {
      "description": "Сломать statement_hidden_3 с помощью cardinal_letter",
      "result": "full_confession"
    }
  ]
}
